### Read File with open

In [3]:
file = open('Sample.txt', 'w')
file.close()

In [5]:
with open('sample.txt', 'w') as file:
    file.write("Hi this is Awais Ali. \nI am learning Python. \nI also want to work in a software house")

In [6]:
file.close()

In [7]:
with open('sample.txt', 'r') as file:
    data = file.read()
    print(data)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house

In [8]:
print(data)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house

In [9]:
data

'Hi this is Awais Ali. \nI am learning Python. \nI also want to work in a software house'

In [11]:
file.name

'sample.txt'

In [12]:
file.mode

'r'

In [13]:
#with open file automatically close
with open('sample.txt', 'r') as file:
    file_stuff = file.read()
    print(file_stuff)
print(file.close())
print(file_stuff)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house
None
Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house

In [14]:
print(file_stuff)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house

In [15]:
print(file.closed)

True

In [16]:
print(file.close())

None

In [17]:
print(file_stuff)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software house

In [26]:
with open('sample.txt', 'r') as file:
    file_stuff = file.readline(4)
    print(file_stuff)
    file_stuff = file.readline(8)
    print(file_stuff)
    file_stuff = file.readline(18)
    print(file_stuff)
    for line in file:
        print(line)

Hi t
his is A
wais Ali.

I am learning Python.

I also want to work in a software house

In [25]:
with open('sample.txt', 'r') as file:
    for line in file:
        print(line)

Hi this is Awais Ali.

I am learning Python.

I also want to work in a software house

In [28]:
with open('sample.txt', 'r') as file:
    line1 = file.readline()
    line2 = file.readline()
    line3 = file.readline()
    if 'Awais' in line1:
        print("Available")

Available

In [29]:
if 'learning' in line2:
    print("Availble")

Availble

In [30]:
if 'sss' in line3:
    print('Avaible')
else: 
    print("Not availbe")

Not availbe

Looping through lines: Typically, you use a loop to read lines until no more lines are left. t's like reading the entire book, line by line.

In [34]:
file = open('sample.txt', 'r')
file.seek(10)

10

In [35]:
file.read(5)

' Awai'

In [36]:
# Uncomment these if working locally, else let the following code cell run.

import urllib.request
url = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/example1.txt'
filename = 'Example1.txt'
urllib.request.urlretrieve(url, filename)

# Download Example file
!wget Example1.txt https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/example1.txt

'wget' is not recognized as an internal or external command,
operable program or batch file.

In [37]:
from pyodide.http import pyfetch

import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/example1.txt"

async def download(url, filename):

    response = await pyfetch(url)

    if response.status == 200:

        with open(filename, "wb") as f:

            f.write(await response.bytes())

await download(filename, "example1.txt")

print("done")

ModuleNotFoundError: No module named 'pyodide'

In [39]:
with open('sample.txt', 'r') as file:
    i = 0;
    for line in file:
        print("Iteration", (i), ": ", line)
        i += 1

Iteration 0 :  Hi this is Awais Ali.

Iteration 1 :  I am learning Python.

Iteration 2 :  I also want to work in a software house

In [40]:
with open('sample.txt', 'r') as file:
    fileAsList = file.readlines()
    print(fileAsList)

['Hi this is Awais Ali. \n', 'I am learning Python. \n', 'I also want to work in a software house']

In [42]:
fileAsList[1]

'I am learning Python. \n'

### Writing file with Open

In [44]:
with open('sample.txt', 'a') as file:
    file.write("This is New line \nthis is second new line \nThis is third new line")

In [46]:
with open('sample.txt', 'r') as file:
    read = file.read()
    print(read)

Hi this is Awais Ali.
I am learning Python.
I also want to work in a software houseThis is New line
this is second new line
This is third new lineThis is New line
this is second new line
This is third new line

In [47]:
Lines = ["I am adding a list. \nThird line is added"]
with open('sample.txt', 'w') as file:
    for line in Lines:
        file.write(line)

In [48]:
with open('sample.txt', 'r') as file:
    read = file.read()
    print(read)

I am adding a list.
Third line is added

In [49]:
with open('sample.txt', 'r') as readfile:
    with open('sample2.txt', 'w') as writefile:
        for line in readfile:
            writefile.write(line)

In [50]:
with open('sample2.txt', 'r') as file:
    read = file.read()
    print(read)

I am adding a list.
Third line is added

In [53]:
Lines = ['This is line1', 'This is line2', 'This']
with open('sample3.txt', 'w') as file2:
    for line in Lines:
        file2.write(line + "\n")
        file2.read()

UnsupportedOperation: not readable

In [52]:
file2.read()

ValueError: I/O operation on closed file.

In [55]:
# Write line to file
exmp2 = 'Example2.txt'
with open(exmp2, 'w') as writefile:
    writefile.write("This a line A")

In [56]:
with open(exmp2, 'r') as readfile:
    stuff = readfile.read()

In [57]:
print(stuff)

This a line A

In [58]:
with open (exmp2, 'w') as writefile:
    writefile.write("This is line A\n")
    writefile.write("This is line B\n")

In [60]:
with open (exmp2, 'r') as readfile:
    data = readfile.read()

In [61]:
print(data)

This is line A
This is line B

In [62]:
# Sample list of text
Lines = ['I am learning Python \n', 'It very interesting \n', 'I am learning from IBM']

In [63]:
with open(exmp2, 'w') as writefile:
    for line in Lines:
        print(line)
        writefile.write(line)

I am learning Python

It very interesting

I am learning from IBM

In [65]:
with open(exmp2, 'w') as writefile:
    writefile.write('Overwrite\n')
with open(exmp2, 'r') as readfile:
    print(readfile.read())

Overwrite

In [71]:
with open(exmp2, 'a') as testwritefile:
    testwritefile.write("Hi, How is it going\n?")
    testwritefile.write("I am doing great\n")
    testwritefile.write("Okay whats new\n")

In [72]:
with open(exmp2, 'r') as readfile:
    print(readfile.read())

Overwrite
Hi, How is it going
?I am doing great
Hi, How is it going
?I am doing great
Okay whats newHi, How is it going
?I am doing great
Okay whats new

In [77]:
with open(exmp2, 'a+') as test:
    test.write("This a+")
    tes = test.read()
    print(tes)

### Pandas: Loading Data
1. For data analysis
2. Pre built functions and classes

In [4]:
#Creating a data frame using the Dictionary
import pandas as pd
songs = {
    'Album' : ['Thriller', 'Back in Black', 'The Dark side of the Moon',\
              'The Bodygaurd', 'Bat out of the Hell'],
    'Realeased': [1982, 1992, 1973, 1992, 1977],
    'Length': ['00:42:19', '00:42:11', '00:42:49', '00:57:44', '00:46:33']
}
songs_frame = pd.DataFrame(songs)
songs_frame

                       Album  Realeased    Length
0                   Thriller       1982  00:42:19
1              Back in Black       1992  00:42:11
2  The Dark side of the Moon       1973  00:42:49
3              The Bodygaurd       1992  00:57:44
4        Bat out of the Hell       1977  00:46:33

In [11]:
print(songs_frame.iloc[4,2])

00:46:33

In [12]:
df = songs_frame
df.index = ['a', 'b', 'c', 'd', 'e']
df

                       Album  Realeased    Length
a                   Thriller       1982  00:42:19
b              Back in Black       1992  00:42:11
c  The Dark side of the Moon       1973  00:42:49
d              The Bodygaurd       1992  00:57:44
e        Bat out of the Hell       1977  00:46:33

In [14]:
df.iloc[0:2, 0:3]

           Album  Realeased    Length
a       Thriller       1982  00:42:19
b  Back in Black       1992  00:42:11

### Pandas: Working with and Saving Data

In [17]:
df['Realeased'].unique()

array([1982, 1992, 1973, 1977])

In [18]:
df['Realeased']>1900

a    True
b    True
c    True
d    True
e    True
Name: Realeased, dtype: bool

### Reading
**Data Structures**
1. DataFrame:
   - Two-Dimensional
   - size-mutable
   - heterogeneous tabular data tructure
     - with labeled axes(rows and columns)
2. Series:
   - One-dimensional labeled array,
   - single column or row

### Series Attributes and Methods
1. values: returns Series data as a Numpy array.
2. index: returns index(labels) of the Series.
3. shape:
4. size
5. mean(), sum(), min(), max()
6. unique(), nunique)
7. sort_values(), sort_index()
8. isnull(), notnull()
9. apply()

In [55]:
# Series Example
import pandas as pd
data = [10,30, 19, 18, 17, 30,0]
s = pd.Series(data)
s
print(s.notnull())

0    True
1    True
2    True
3    True
4    True
5    True
6    True
dtype: bool

In [22]:
print(s[2])

19

In [23]:
print(s.iloc[3])

18

In [24]:
print(s[:3])

0    10
1    30
2    19
dtype: int64

In [29]:
data = {
    'Name': ['Ali', 'Awais', 'Imran', 'Haroon', 'Saad'],
    'Age': [32,54, 23,53,12],
    'City': ['Lhr', 'ISB', 'Krch', 'Pindi', 'Mltn']
}
df = pd.DataFrame(data)
df['Name']

0       Ali
1     Awais
2     Imran
3    Haroon
4      Saad
Name: Name, dtype: object

In [31]:
print(df.iloc[2])

Name    Imran
Age        23
City     Krch
Name: 2, dtype: object

In [32]:
print(df.iloc[1])

Name    Awais
Age        54
City      ISB
Name: 1, dtype: object

In [35]:
print(df[['Name', 'Age']])
print(df[1:3])

     Name  Age
0     Ali   32
1   Awais   54
2   Imran   23
3  Haroon   53
4    Saad   12
    Name  Age  City
1  Awais   54   ISB
2  Imran   23  Krch

In [37]:
unique_dates = df['Age'].unique()
unique_dates

array([32, 54, 23, 53, 12])

In [42]:
high_above_102 = df[df['Age']>50]
high_above_102

     Name  Age   City
1   Awais   54    ISB
3  Haroon   53  Pindi

In [43]:
df.to_csv('trading_data.csv', index=False)

In [44]:
titanic = pd.read_csv('E:\\titanic.csv')

In [45]:
titanic.to_csv('Titanic.csv')

### DataFrame Attributes and Methods
1. Shape: returns dimensions (number of rows and columns)
2. info(): provides summary
3. describe(): statistical summary
4. head(), tail(), min(), max()
5. sort_values()
6. groupby(): Group data based on specific columns for aggregation
7. fillna(), drop(), rename(): handle missing values
8. apply(): apply funtion to each element, row or column of the dataframe

In [46]:
df.shape

(5, 3)

In [56]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [59]:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [60]:
type(x)

pandas.core.frame.DataFrame

In [62]:
z = df[['Department', 'Salary', 'ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [64]:
#write your code here
import pandas as pd
data = { 'Student': ['David', 'Samuel', 'Terry', 'Even'],
        'Age': [27, 24, 22, 32],
        'Country': ['UK', 'Canada', 'China', 'USA'],
        'Course': ['Python', 'Data Structures', 'Machine Learning', 'Web Development'],
        'Marks': ['85', '72', '89', '76']
       }
Data = pd.DataFrame(data)
print(Data)

  Student  Age Country            Course Marks
0   David   27      UK            Python    85
1  Samuel   24  Canada   Data Structures    72
2   Terry   22   China  Machine Learning    89
3    Even   32     USA   Web Development    76

In [69]:
b = Data[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [71]:
c = Data[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [72]:
x = Data['Student'] #to see as a Series
x

0     David
1    Samuel
2     Terry
3      Even
Name: Student, dtype: object

In [73]:
type(x)

pandas.core.series.Series

### Exercise 2: loc() and iloc() functions
1. loc(): is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passend in it.
   - Simple syntax for understanding:
     - loc[row_label, column_label]
2. iloc() is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last emlement of the range  passed in it.
   - Simple Syntax
     - iloc[row_index, column_index]

In [74]:
Data.iloc[0, 0]

'David'

In [75]:
Data

  Student  Age Country            Course Marks
0   David   27      UK            Python    85
1  Samuel   24  Canada   Data Structures    72
2   Terry   22   China  Machine Learning    89
3    Even   32     USA   Web Development    76

In [76]:
Data.iloc[0,2]

'UK'

In [77]:
Data.iloc[1, 2]

'Canada'

In [81]:
Data.loc[0, 'Course']

'Python'

In [84]:
df2 = Data
df2 = df2.set_index('Student')
df2

         Age Country            Course Marks
Student
David     27      UK            Python    85
Samuel    24  Canada   Data Structures    72
Terry     22   China  Machine Learning    89
Even      32     USA   Web Development    76

In [87]:
df2.loc['David', 'Marks']

'85'

In [90]:
df2.loc['Terry', 'Country']

'China'

In [92]:
df2.loc['Even', 'Course']

'Web Development'

In [94]:
df2.iloc[2,2]

'Machine Learning'

### Slicing
using loc() and select 1:4 will get a different result tahn using iloc() to select rows 1:4

In [95]:
df = Data
df.iloc[0:2, 0:3]

  Student  Age Country
0   David   27      UK
1  Samuel   24  Canada

In [96]:
df.loc[0:2, 'Student':'Course']

  Student  Age Country            Course
0   David   27      UK            Python
1  Samuel   24  Canada   Data Structures
2   Terry   22   China  Machine Learning

In [101]:
df.iloc[0:2, 0:3]

  Student  Age Country
0   David   27      UK
1  Samuel   24  Canada

In [105]:
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv"
Data = pd.read_csv(filename)

In [106]:
Data

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [108]:
Data.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [111]:
x = Data[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [112]:
x = Data['Product'] #to get data as series
x

0        Laptop
1    Smartphone
2    Desk Chair
3      Notebook
4       Monitor
Name: Product, dtype: object

In [113]:
x = Data[['Product']]
x

      Product
0      Laptop
1  Smartphone
2  Desk Chair
3    Notebook
4     Monitor

In [114]:
y = Data[['Product', 'Category', 'Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1

In [117]:
print(Data)
print(Data.iloc[0,0])

   OrderID     Product     Category  Quantity  Price  Total   OrderDate  \
0        1      Laptop  Electronics         2    800   1600  2022-01-10
1        2  Smartphone  Electronics         3    600   1800  2022-02-15
2        3  Desk Chair    Furniture         5    150    750  2022-03-12
3        4    Notebook   Stationery        10      2     20  2022-04-05
4        5     Monitor  Electronics         1    300    300  2022-05-21

  CustomerCity
0     New York
1  Los Angeles
2      Chicago
3      Houston
4        Miami
1

In [118]:
Data

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [122]:
print(Data.iloc[3,2])

Stationery

In [124]:
print(Data.loc[4, 'Product'])

Monitor

In [125]:
print(Data.iloc[0:2, 0:3])

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics